Repository: davide-andreoli/ArcadiaApp
Catalog: Localizable.xcstrings
Source language: en
Languages: it

source: • Game matching and cover downloading are provided thanks to [OpenVGDB](https://github.com/OpenVGDB/OpenVGDB)
it: • Il matching dei giochi e il download delle copertine sono forniti grazie a [OpenVGDB](https://github.com/OpenVGDB/OpenVGDB)

source: Action Pad
it: Bottoni azione

source: Add new game
it: Aggiungi un nuovo gioco

source: Add to library
it: Aggiungi

source: Advanced DPad
it: DPad Avanzato

source: Allowed extensions
it: Estensioni permesse

source: App Icon
it: Icona dell'app

source: Arcadia and its emulators allow you to save your progress in two ways: • Saves: This is the standard way of saving your game progress, similar to the save files in game cartridges. These are generated and updated automatically by the app. Each game can have only one save file. This format is usually portable, and you can find these save files in Arcadia/Saves if you want to switch emulator apps. • States: This is a non-standard way of saving your game progress, enabled by the emulation process. It creates a snapshot of the game's exact state when you hit the save button. Each game can have up to three state files. This format is usually not portable as it depends on the emulator, but you can find these state files in Arcadia/States.
it: Arcadia e i suoi emulatori ti permettono di salvare i tuoi progressi in due modi: • Salvataggi: Questo è il modo standard di salvare i progressi di gioco, simile ai file di salvataggio nelle cartucce dei giochi, vengono generati e aggiornati automaticamente dall'app. Ogni gioco può avere un solo file di salvataggio. Questo formato è solitamente compatibile con altre applicazioni simili, li puoi trovare in Arcadia/Saves se desideri cambiare applicazione. • Stati: Questo è un modo non standard di salvare i progressi di gioco, abilitato dal processo di emulazione. Consiste nel creare uno snapshot dello stato esatto del gioco quando premi il pulsante di salvataggio. Ogni gioco può avere fino a tre file di stato. Questo formato può non essere compatibile al 100% poiché dipende dall'emulatore, ma li puoi trovare in Arcadia/States.

source: Arcadia is a frontend for multiple emulators (also called cores), each corresponding to a different game system. Specifically, Arcadia is a frontend for the Libretro API, using the libretro versions of the cores. It aims to provide a simple and accessible way to enjoy retro game systems, not to replace RetroArch. If you are tech-savvy and want more control, consider using the RetroArch app. In Arcadia, you'll find only one core per game system, selected by me based on various criteria. Customization of core options is not available (though this may change in future versions).
it: Arcadia è un frontend per diversi emulatori (chiamati anche core), ognuno corrispondente a un diverso sistema di gioco. In particolare, Arcadia è un frontend per l'API Libretro, utilizzando le versioni Libretro dei core. Il suo obiettivo è fornire un modo semplice e accessibile per godersi i sistemi di gioco retro, non sostituire RetroArch. Se sei esperto di tecnologia e vuoi avere più controllo, considera l'uso dell'app RetroArch. In Arcadia troverai solo un core per ogni sistema di gioco, selezionato da me in base a vari criteri. La personalizzazione delle opzioni del core non è disponibile (anche se questo potrebbe cambiare nelle future versioni).

source: Arcadia is a labor of love, born from my passion for Apple and my desire to learn new things. As such, it is an imperfect product developed in my free time. If you enjoy the app and would like to contribute to its development, here are some ways you can help: • Report any bugs you find, including steps to reproduce them. • Share any ideas for new features or improvements to enhance the user experience. • I am not a designer, so if you'd like to submit a custom app icon, I would love to include it in the app with credits to you. • If you are a retro game developer and would like for your game to be featured in the app, I'd love to include it. • Currently, Arcadia is closed source, but I plan to make it open source once I organize the repository better. When that happens, you'll be able to contribute directly to the code if you wish.
it: Arcadia nasce dalla mia passione per i prodotti Apple e dal desiderio di imparare cose nuove. Pertanto, è un prodotto imperfetto sviluppato nel mio tempo libero. Se ti piace l'app e desideri contribuire al suo sviluppo, ecco alcuni modi in cui puoi aiutare: • Segnala eventuali bug che trovi, includendo i passaggi per riprodurli. • Condividi qualsiasi idea per nuove funzionalità o miglioramenti per migliorare l'esperienza dell'utente. • Non sono un designer, quindi se desideri inviare un'icona personalizzata per l'app, mi piacerebbe includerla nell'app con i dovuti crediti. • Se sei uno sviluppatore di giochi retrò e ti piacerebbe che il tuo gioco fosse incluso nell'app, mi farebbe piacere aggiungerlo. • Attualmente, Arcadia è a codice chiuso, ma ho intenzione di renderlo open source una volta organizzato meglio il repository. Quando ciò accadrà, potrai contribuire direttamente al codice, se lo desideri.

source: Arcadia is built on numerous cores developed by extraordinary developers who have made it possible to relive classic console experiences on other devices. In Arcadia, you will find the following cores:
it: Arcadia è costruita su numerosi core sviluppati da straordinari sviluppatori che hanno reso possibile rivivere le esperienze delle console classiche su altri dispositivi. In Arcadia troverai i seguenti core:

source: Button Image
it: Immagine

source: Button opacity
it: Opacità dei bottoni

source: Button size
it: Dimensione dei bottoni

source: Button spacing
it: Spaziatura dei bottoni

source: Buttons
it: Bottoni

source: By default, iCloud synchronization is disabled, but you can enable it in the settings. Once activated, all your local content will be uploaded to iCloud. If the local files have a more recent modification date than those in iCloud, they will overwrite the existing files in the cloud. For example, if you have a recent save file for a game and enable iCloud sync, that save file will be uploaded and replace the existing file in iCloud. If you decide to turn off iCloud synchronization, all files stored in iCloud will be downloaded to your local folder. When iCloud sync is enabled, the iCloud Drive Arcadia folder is updated through two processes: periodic syncs and specific actions. During periodic syncs, the iCloud Drive Arcadia folder acts as the master. If the iCloud folder contains a file that the local folder does not, it will be downloaded. Conversely, if the local folder contains a file not present in the iCloud folder, it will be deleted. All files that exist in both locations will be kept in sync, with the most recent versions replacing older ones. Specific actions, such as loading or deleting a game, will update the master reference each time they are performed.
it: Di default, la sincronizzazione di iCloud è disabilitata, ma puoi attivarla nelle impostazioni. Una volta attivata, tutti i tuoi contenuti locali verranno caricati su iCloud. Se i file locali hanno una data di modifica più recente rispetto a quelli su iCloud, sovrascriveranno i file esistenti nel cloud. Ad esempio, se hai un file di salvataggio recente di un gioco e abiliti la sincronizzazione con iCloud, quel file di salvataggio verrà caricato e sostituirà il file esistente su iCloud. Se decidi di disattivare la sincronizzazione di iCloud, tutti i file memorizzati su iCloud verranno scaricati nella tua cartella locale. Quando la sincronizzazione di iCloud è abilitata, la cartella Arcadia di iCloud Drive viene aggiornata tramite due processi: sincronizzazioni periodiche e azioni specifiche. Durante le sincronizzazioni periodiche, la cartella Arcadia di iCloud Drive agisce come riferimento principale. Se la cartella iCloud contiene un file che la cartella locale non ha, questo verrà scaricato. Al contrario, se la cartella locale contiene un file non presente nella cartella iCloud, verrà eliminato. Tutti i file presenti in entrambe le posizioni verranno mantenuti sincronizzati, con le versioni più recenti che sostituiranno quelle meno recenti. Azioni specifiche, come il caricamento o l'eliminazione di un gioco, aggiorneranno il riferimento principale ogni volta che vengono eseguite.

source: Cancel
it: Annulla

source: Change image
it: Cambia immagine

source: Clear saves and states
it: Elimina salvataggi e stati

source: Close
it: Chiudi

source: Confirm
it: Conferma

source: Console's folders
it: Cartelle della console

source: Contribute
it: Contribuisci

source: Controls
it: Controlli

source: Copying data to iCloud folder
it: Copio i dati nella cartella di iCloud

source: Credits
it: Crediti

source: Customization
it: Personalizzazione

source: Customize background color
it: Personalizza il colore di background

source: Delete
it: Cancella

source: Developer
it: Sviluppatore

source: Direction Pad
it: Bottoni direzionali

source: Dismiss
it: Nascondi

source: Down arrow
it: Freccia giù

source: Enter
it: Invio

source: Enter the new game name
it: Inserisci il nuovo nome del gioco

source: Enter the new name
it: Inserisci il nuovo nome del gioco.

source: Enter the new name for the game.
it: Inserisci il nuovo nome del gioco.

source: Export save
it: Esporta salvataggio

source: Featured Games
it: Giochi Consigliati

source: Final preview
it: Anteprima finale

source: Find out more on the game's page
it: Scopri di più nella pagina del gioco

source: Force sync
it: Forza la sincronizzazione

source: Game
it: Gioco

source: Game Collection
it: Collezione

source: Game console
it: Console

source: Game Consoles
it: Consoles

source: Game loaded!
it: Gioco importato!

source: Game Systems
it: Sistemi di gioco

source: Game view background color
it: Colore di background della vista di gioco

source: Games
it: Giochi

source: Get new games reccomendation
it: Ricevi raccomandazioni per nuovi giochi

source: Haptic Feedback
it: Feedback Aptico

source: Help
it: Aiuto

source: Hide buttons
it: Nascondi bottoni

source: I considered whether to create a customized interface for each system, mimicking the original buttons, or to use a standard interface common to all cores. I chose the latter for two reasons: • Developing a custom interface for each system is time-consuming, as each asset would need to be manually created in Inkscape or SwiftUI. • A standardized button appearance makes the app more cohesive and easier to adapt to different systems. This choice required some general decisions for button appearance. Below are the mappings for all systems.
it: Ho valutato se creare un'interfaccia personalizzata per ogni sistema, imitando i pulsanti originali, oppure utilizzare un'interfaccia standard comune a tutti i core. Ho scelto la seconda opzione per due motivi: • Sviluppare un'interfaccia personalizzata per ogni sistema richiede molto tempo, poiché ogni risorsa dovrebbe essere creata manualmente in Inkscape o SwiftUI. • Un aspetto standardizzato dei pulsanti rende l'app più coerente e più facile da adattare a diversi sistemi. Questa scelta ha richiesto alcune decisioni generali per l'aspetto dei pulsanti. Di seguito sono riportati i mapping per tutti i sistemi.

source: I might explore custom interfaces in the future, but not right now. Arcadia supports local multiplayer for games designed for more than two players. In the settings or from the in-game menu (accessible by clicking the Arcadia button), you can see the player mapped for touch input and each game controller, if connected. By default, touch input controls player one, the first controller controls player one, and each additional controller controls the next available player.
it: Potrei esplorare interfacce personalizzate in futuro, ma non al momento. Arcadia supporta il multiplayer locale per i giochi progettati per più di due giocatori. Nelle impostazioni o dal menu di gioco (accessibile cliccando sul pulsante Arcadia), puoi vedere i giocatori associati al controllo touch e a ciascun controller di gioco, se collegato. Per impostazione predefinita, i controlli touch gestiscono il giocatore uno, il primo controller gestisce il giocatore uno e ogni controller aggiuntivo gestisce il giocatore successivo disponibile.

source: If your game does not show up, or if you loaded the game manually, you can pull to refresh this view, or use the button below.
it: Se il tuo gioco non viene visualizzato, o se hai caricato il gioco manualmente, puoi trascinare verso il basso per aggiornare questa vista o utilizzare il pulsante qui sotto.

source: Import
it: Importa

source: Import game
it: Importa gioco

source: Importing game
it: Importando il gioco

source: In some cases, multiple game systems will be compatible with your game file. Please make sure to select the correct one when importing.
it: In alcuni casi, diverse console sono compatibili con il tuo gioco. Assicurati di selezionare la console corretta quando importi.

source: In the featured games section you'll find some game provided by some developers who decided to partner with Arcadia to distribute their games through the app. Aside from those, there are many online resources to guide you in dumping game cartridges into ROMs, acquiring ROMs, or finding homebrew games.
it: Nella sezione dei giochi in evidenza troverai alcuni titoli forniti da sviluppatori che hanno deciso di collaborare con Arcadia per distribuire i loro giochi tramite l'app. Oltre a questi, esistono molte risorse online che ti possono guidare nel trasferimento delle cartucce di gioco in ROM, nell'acquisizione di ROM o nel trovare giochi homebrew.

source: In this section, you'll find various tips to help you navigate the interface and make the most of the app.
it: In questa sezione troverai vari suggerimenti per aiutarti a navigare nell'interfaccia e sfruttare al meglio l'app.

source: Incorrect game loaded
it: Caricato un gioco scorretto

source: Input settings
it: Impostazioni di input

source: Introduction
it: Introduzione

source: It seems like you loaded an incompatible game file.
it: Sembra che tu abbia caricato un file di gioco incompatibile.

source: Keep in mind that for recommendations to be found your games have to match the internal database, this won't work with homebrew games unfortunately.
it: Tieni presente che affinché vengano trovate raccomandazioni, almeno uno dei tuoi giochi deve corrispondere al database interno; purtroppo, questo non funzionerà con i giochi homebrew.

source: Keyboard mapping
it: Mappatura tastiera

source: Left Alt
it: Alt Sinistro

source: Left arrow
it: Freccia Sinistra

source: Left Ctrl
it: Ctrl Sinistro

source: Left Shift
it: Shift Sinistro

source: Load State
it: Carica Stato

source: Mapping
it: Mappatura

source: Name
it: Nome

source: No controller connected
it: Nessun controller collegato

source: No Image
it: Nessuna immagine

source: No keyboard connected
it: Nessuna tastiera connessa

source: No recommendation found.
it: Nessuna raccomandazione trovata.

source: No screenshots available
it: Nessuno screenshot

source: No selection
it: Nessuna console selezionata.

source: Numpad 0
it: Tastierino 0

source: Numpad 1
it: Tastierino 1

source: Numpad 2
it: Tastierino 2

source: Numpad 3
it: Tastierino 3

source: Numpad 4
it: Tastierino 4

source: Numpad 5
it: Tastierino 5

source: Numpad 6
it: Tastierino 6

source: Numpad 7
it: Tastierino 7

source: Numpad 8
it: Tastierino 8

source: Numpad 9
it: Tastierino 9

source: Opacity
it: Opacità

source: Open core files directory
it: Apri la cartella dei file di core

source: Open games directory
it: Apri la cartella dei giochi

source: Open images directory
it: Apri la cartella delle immagini

source: Open saves directory
it: Apri la cartella dei salvataggi

source: Open states directory
it: Apri la cartella degli stati

source: Open storage directory
it: Apri la cartella di archiviazione

source: Open this console's collection
it: Apri la collezione di questa console

source: Organization
it: Organizzazione

source: Other
it: Altro

source: Play this game
it: Gioca a questo gioco

source: Player 1
it: Giocatore 1

source: Player 2
it: Giocatore 2

source: Player 3
it: Giocatore 3

source: Player 4
it: Giocatore 4

source: Player selection
it: Selezione giocatore

source: Please pick a game system.
it: Scegli una console.

source: Recommendation
it: Suggerimenti

source: Redownload default image
it: Riscarica immagine di default

source: Refresh game list
it: Ricarica la lista dei giochi

source: Rename
it: Rinomina

source: Respect the silent switch
it: Rispetta la modalità silenziosa

source: Right Alt
it: Alt Destro

source: Right arrow
it: Freccia Destra

source: Right Shift
it: Shift Destro

source: Save screenshot
it: Salva screenshot

source: Save State
it: Salva stato

source: Save states
it: Salva stati

source: Saves and States
it: Salvataggi e Stati

source: Scale
it: Scala

source: Select a game console using the sidebar
it: Seleziona una console usando la barra laterale

source: Settings
it: Impostazioni

source: Share game
it: Condividi gioco

source: Share on social media
it: Condividi sui social media

source: Shoulder buttons
it: Bottoni retro

source: Silence audio
it: Silenzia l’audio

source: Small buttons
it: Bottoni piccoli

source: Socials
it: Social

source: Spacing
it: Spaziatura

source: Storage
it: Archiviazione

source: Sync data to iCloud
it: Sincronizza con iCloud

source: Synchronization
it: Sincronizzazione

source: The first time Arcadia starts, it will create a folder to store all documents. On a Mac, you can find this inside the Documents folder, and on an iPhone, in the Files app. Inside, you'll find a Games folder, a Saves folder, and a States folder. The app's game library will display all files in the Games folder with their respective names. Each game has one save and one state, and all files should share the same name. If you rename the games through the app, everything will be managed for you. If you rename them manually, ensure you also rename the saves and states.
it: La prima volta che Arcadia viene avviata, creerà una cartella per memorizzare tutti i documenti. Su un Mac, puoi trovarla all'interno della cartella Documenti, e su un iPhone, nell'app File. All'interno, troverai una cartella Giochi, una cartella Salvataggi e una cartella Stati. La libreria di giochi dell'app mostrerà tutti i file nella cartella Giochi con i rispettivi nomi. Ogni gioco ha un salvataggio e uno stato, e tutti i file devono avere lo stesso nome. Se rinomini i giochi tramite l'app, tutto sarà gestito automaticamente. Se li rinomini manualmente, assicurati di rinominare anche i salvataggi e gli stati.

source: There was an issue in loading the screenshot feature
it: C'è stato un problema nel caricare lo screenshot.

source: This application is merely a frontend to the Libretro API, and it wouldn't be possible without the incredible work done by the [Libretro Team](https://www.libretro.com). Special thanks also go to [Retroreversing](https://www.retroreversing.com) for their invaluable resources, which have made the entire process much easier.
it: Questa applicazione è semplicemente un frontend per l'API Libretro, e non sarebbe possibile senza il lavoro straordinario svolto dal [Libretro Team](https://www.libretro.com). Un ringraziamento speciale va anche a [Retroreversing](https://www.retroreversing.com) per le loro risorse preziose, che hanno reso l'intero processo molto più semplice.

source: This console can load files with any of the above extension.
it: Questa console può aprire file con una di queste estensioni.

source: This developer has generously made their games available for free, allowing more people to enjoy retro gaming with ease. If you appreciate their work, consider showing your support through the links above.
it: Questo sviluppatore ha generosamente reso i suoi giochi disponibili gratuitamente, permettendo a più persone di godersi i giochi retrò con facilità. Se apprezzi il loro lavoro, prendi in considerazione l'idea di mostrare il tuo supporto attraverso i link qui sopra.

source: This game is open source, if you're interested you can find the game's code in its repository
it: Questo gioco è open source, se sei interessato puoi trovare il codice del gioco nel suo repository.

source: This game was provided for free by its author, but if you want to support their work you should consider following them on social media and donating through the links on this page.
it: Questo gioco è stato reso disponibile gratuitamente dal suo autore, ma se vuoi supportare il suo lavoro, considera di seguirlo sui social media e di fare una donazione tramite i link presenti su questa pagina.

source: Up arrow
it: Freccia Su

source: Use the slider to adjust button opacity, double tap the slider to restore its original value. A lower value means that the button will be more transparent.
it: Usa i cursori per modificare l’opacità dei bottoni, fai un doppio tocco su un cursore per ripristinare il suo valore originale. Un valore più basso significa che il bottone sarà più trasparente.

source: Use the sliders to adjust button scale, double tap a slider to restore its original value
it: Usa i cursori per modificare la scala dei bottoni, fai un doppio tocco su un cursore per ripristinare il suo valore originale.

source: Use the sliders to adjust button spacing, double tap a slider to restore its original value
it: Usa i cursori per modificare la spaziatura dei bottoni, fai un doppio tocco su un cursore per ripristinare il suo valore originale

source: Use the toggle to turn on the customization, and pick a color using the slider. To go back to the default behaviour, simply turn off the toggle.
it: Usa l’interruttore per attivare la personalizzazione, e scegli un colore usando l’apposito menu. Per tornare al comportamento di default, disattiva la personalizzazione,

source: Use these links to access the folders where this console stores files.
it: Usa questi link per accedere alle cartelle dove questa console tiene i file.

source: When deactivated, audio will play even if the silent switch is activated. This setting change will take effect only after an app restart.
it: Se disattivato, l’audio verrà riprodotto anche se la modalità silenziosa è attivata. Il cambio di questa impostazione avrà effetto solo dopo un riavvio dell’applicazione.

source: Where to Find Games?
it: Dove trovare i giochi?

source: With this console you can open games in the following formats:
it: Con questa console puoi aprire file di gioco nei seguenti formati:

source: You will find the game in the console's collection.
it: Troverai il gioco nella collezione della console.

source: Your game collection is empty, add new games using the plus button at the top.
it: La tua collezione è vuota, aggiungi nuovi giochi usando il bottone + in alto.
